vbirjuko/EFM32_ROMI_Robot/Maze.c
      while (!profiler_data_ready) {
          if (profiler_error_code) {
              char err_code_str[] = "Error Code 0", last_idx_str[] = "Last_index =  0";
              squareXY(0,0, 127, 63, 1);
              update_display();
              err_code_str[11] = '0'+profiler_error_code;
              last_idx_str[14] = last_index % 10 + '0';
              last_idx_str[13] = (last_index / 10) ? (last_index / 10 + '0') : ' ';
              putstr(0, 3, "Profiler 1", 1);
              putstr(0, 4, err_code_str, 1);
              putstr(0, 5, last_idx_str, 1);
              profiler_error_code = 0;
#ifdef DATALOG
              data_log_finish();
#endif
              return 1;
          }
          Rand();
          BlueTooth_parse();
          continue;
      }
//      LaunchPad_Output(0);
      available = node_configuration;
      current_segment_length = segment_length;
      profiler_data_ready = 0;

      // если указана величина клетки, то подгоняем длину сегмента под этот шаг.
      if (data.cell_step) {
          current_segment_length = ((current_segment_length + data.cell_step/2) / data.cell_step) * data.cell_step;
          if (current_segment_length == 0) current_segment_length = data.cell_step;
      }
      update_coordinate(&my_coordinate, current_segment_length, (bearing_dir_t)move_direction);

      for (current_index = 0; current_index < max_map_cell; current_index++) { // ищем похожие координаты
          // И проверяем, были ли мы уже здесь?
          if ((ABS(my_coordinate.east - map[current_index].coordinate.east) < data.tolerance) &&
              (ABS(my_coordinate.north - map[current_index].coordinate.north) < data.tolerance)) {
              // я тут был.
              my_coordinate.east = map[current_index].coordinate.east;
              my_coordinate.north = map[current_index].coordinate.north;
              break; // current_index указывает на ячейку карты.
          }  // нет, мы тут еще не были
      }

      if (data.pathlength == 0) {
          if (current_index == max_map_cell && expect_index == UNKNOWN) {  // новая ячейка
              map[current_index].coordinate.east = my_coordinate.east;
              map[current_index].coordinate.north = my_coordinate.north;
              map[current_index].node_link [(move_direction + back) & TURN_MASK] = last_index;
              map[current_index].node_link [(move_direction+straight) & TURN_MASK] = UNKNOWN;
              map[current_index].node_link [(move_direction + left)  & TURN_MASK] = UNKNOWN;
              map[current_index].node_link [(move_direction + right) & TURN_MASK] = UNKNOWN;

              map[current_index].pass_count[(move_direction + back) & TURN_MASK] = 1;
              map[current_index].pass_count[(move_direction+straight) & TURN_MASK]	=	(available & STRAIGHT_MASK) ? 0 : 4;
              map[current_index].pass_count[(move_direction + left) & TURN_MASK] = 	(available & LEFT_MASK)     ? 0 : 4;
              map[current_index].pass_count[(move_direction + right)& TURN_MASK] = 	(available & RIGHT_MASK)    ? 0 : 4;

              if (++max_map_cell > MAX_MAP_SIZE) {
                  drop_command_queue();
                  squareXY(0,0, 127, 63, 1);
                  update_display();
                  putstr(0, 3, " OUT OF MEMORY  ", 1);
                  max_map_cell = MAX_MAP_SIZE;
              }
          } else { // старая ячейка
              if ((expect_index != UNKNOWN) && (expect_index != current_index)) {
                  if ((expect_index != UNKNOWN) && data.ignore_coordinate_error) {
                      current_index = expect_index;
                      my_coordinate.north = map[expect_index].coordinate.north;
                      my_coordinate.east  = map[expect_index].coordinate.east;
                  } else {
                      char number_str[16];
                      unsigned int strlen;
                      drop_command_queue();
                      squareXY(0,0, 127, 63, 1);
                      update_display();
                      putstr(0, 2, "I AM LOST AGAIN", 1);
                      putstr(0, 3, "Expect ", 1);
                      num2str(expect_index, number_str);
                      putstr(8, 3, number_str, 1);
                      strlen = num2str(map[expect_index].coordinate.east, number_str);
                      putstr(0, 4, number_str, 1);
                      putstr(strlen, 4, ",", 1);
                      num2str(map[expect_index].coordinate.north, number_str);
                      putstr(strlen+1, 4, number_str, 1);
                      putstr(0, 5, "Current ", 1);
                      num2str(current_index, number_str);
                      putstr(8, 5, number_str, 1);
                      strlen = num2str(my_coordinate.east, number_str);
                      putstr(0, 6, number_str, 1);
                      putstr(strlen, 6, ",", 1);
                      num2str(my_coordinate.north, number_str);
                      putstr(strlen+1, 6, number_str, 1);
#ifdef DATALOG
                      data_log_finish();
#endif
                      return 1;
                  }
              }
              if (skippasscount == 0) {
                  if (map[current_index].pass_count[(move_direction + back) & TURN_MASK] < 2) {
                      map[current_index].pass_count[(move_direction + back) & TURN_MASK] += 1;
                  }
              } else {
                  skippasscount--;
              }
              map[current_index].node_link [(move_direction + back) & TURN_MASK] = last_index;
          }
          if (!available) {
              while (profiler_queue_empty == 0) continue;
              switch (check_color()) {
                case red:
                  data.red_cell_nr = current_index;
                  found_red = 1;
                  LaunchPad_Output(RED);
                  data.red_wall = OPT_MeasureFrontWallDistance();
                  break;

                case green:
                  data.green_cell_nr = current_index;
//                  put_command(command_wait | 2 * FRAMESCANPERSECOND);
                  LaunchPad_Output(GREEN);
                  data.green_wall = OPT_MeasureFrontWallDistance();
                  break;

