vbirjuko/EFM32_ROMI_Robot/Maze.c
                  }
                  pathsequence++;
              }
              block_profiler(1);
              while (((length[pathsequence] & COMMAND_MASK) == command_forward) && (pathsequence < data.pathlength)) {
                  while (put_command(length[pathsequence])); // после поворота обязательна команда вперед
                  pathsequence++;
                  play++;
              }
              block_profiler(0);
          }
          if ((pathsequence >= data.pathlength) && (play < 2)) {
              data.pathlength = 0;
              skippasscount = 1;
          }
          play--;
      } else {
//          LaunchPad_Output(GREEN);
          switch (turn_direction) {
            case straight:
              break;

            case left:
            case right:
            case back:
              put_command(command_turn | turn_direction);
              break;
          }

          move_direction += turn_direction;
          move_direction &= TURN_MASK;

          if (map[current_index].pass_count[move_direction] < 2) {
              map[current_index].pass_count[move_direction] += 1;
          } else LaunchPad_Output(RED); // Ошибка!!! Выбран красный коридор!
          expect_index = map[current_index].node_link[move_direction];

          if (expect_index != UNKNOWN) { // то надо дать знать длину сегмента.
            switch (move_direction) {
              case north:
                next_segment_length = map[expect_index].coordinate.north - map[current_index].coordinate.north;
                break;
              case south:
                next_segment_length = map[current_index].coordinate.north - map[expect_index].coordinate.north;
                break;
              case east:
                next_segment_length = map[expect_index].coordinate.east - map[current_index].coordinate.east;
                break;
              case west:
                next_segment_length = map[current_index].coordinate.east - map[expect_index].coordinate.east;
                break;
            }
        } else next_segment_length = 0;
        put_command(command_forward | next_segment_length);
      }
      last_index = current_index;
  } while (1);

  finish:
  while (profiler_queue_empty == 0) continue;
#ifdef DATALOG
  data_log_finish();
#endif
//  copy_data32_dma((uint32_t *)length, (uint32_t *)data.length, data.pathlength);
//  copy_data_dma(path, data.path, data.pathlength);
  data.map_size = max_map_cell;
  spi_write_eeprom(ROM_map_addr, (uint8_t *)&map, sizeof(map));
  Search_Short_Way_with_turns();
  data.crc32 = calc_crc32((uint8_t*)&data, sizeof(data)-4);
  spi_write_eeprom(EEPROM_COPY_ADDRESS, (uint8_t *)&data, sizeof(data));
  spi_write_eeprom(EEPROM_CONFIG_ADDRESS, (uint8_t *)&data, sizeof(data));
  return 0;
}
//


#include "em_common.h"


unsigned int calculation_time;
static uint32_t path_length_table[MAX_MAP_SIZE*2];

#define QUEUE_SIZE  64
static unsigned int sort_idx[QUEUE_SIZE], sort_tail=0;

static unsigned int insert_val(unsigned int val, unsigned int idx) {
    unsigned int i;

    if (++sort_tail > (QUEUE_SIZE-1)) return 1;
    for (i = sort_tail-1; i > 0; i--) {
        if(path_length_table[sort_idx[i-1]] < val) {
            sort_idx[i] = sort_idx[i-1];
        } else break;
    }
    sort_idx[i] = idx;
    return 0;
}

static unsigned int extract_val(void) {
    if (sort_tail)return sort_idx[--sort_tail];
    else          return sort_idx[sort_tail];
}

int brakepath = 0;

int TimeToRunStraight(int distance) {  // in milliseconds from millimeters.
  int result = 0;
  if (distance < brakepath * 2) {
      result = sqrt(3000000LL * distance/ 11 /data.acceleration);
  } else if ((distance + 2*brakepath) < 7159) {
      result = 300000 * (distance + 2*brakepath)/(11 * data.maxmotor);
  } else {
      result = 27273 * (distance + 2*brakepath)/data.maxmotor;
  }
  if (result) return result;
  else return 1;
}

#define TURNCOST  ((TRACK_WIDE * 314 + 200) / 400)

void InitBrakePath(void) {
  // Расстояние, необходимое для торможения от максимальной скорости:
  // (220mm/100)^2 * (V^2 - v^2) / (2 * a * 400*60)
  brakepath = (data.maxmotor*data.maxmotor)/data.acceleration*121/1200000;
  // turn length: 143mm wide * Pi / 4 = 112mm - each wheel run to turn 90 degree.
  data.turncost = TimeToRunStraight(TURNCOST);
}

unsigned int Search_Short_Way_with_turns(void) {

  unsigned int k, min_index, destination, destination_map, break_flag = 0;
  int	distance;
  int prev_bearing, bearing;

  fill_data32_dma(0xffffffff, path_length_table, data.map_size*2);
  data.pathlength = 0;

  InitBrakePath();
  spi_read_eeprom(ROM_map_addr, (uint8_t *)&map, sizeof(map));

  // переводим в двухслойную карту
  // однозначное соответствие: каждый узел делится на два n*2 и (n*2)+1
  // между ними сегмент длиной стоимостью поворота. К четным узлам примыкают
  // меридианальные сегменты - север/юг, к нечетным широтные - запад/восток.
  // каждый из этих сегментов удлинняется на стоимость прямого прохода узла.

//  benchmark_start();
  while (dma_flag) continue; // ждём окончания fill_dma path_length[] <= 0xFFFFFFFF
  // Начинаем поиск с конца - стартовая точка финиш.
  // Причем, прибытие с любой стороны допустимо.
  path_length_table[data.red_cell_nr * 2] = 0;
  path_length_table[data.red_cell_nr * 2 + 1] = 0;

  sort_tail = 0;
  if (insert_val(0, data.red_cell_nr * 2)) return 1;
  if (insert_val(0, data.red_cell_nr * 2 + 1)) return 1;

  // Составляем карту высот по алгоритму Дейкстры
  while (sort_tail) {
      min_index  = extract_val();
      for (k = 0; k < 2; k++) {
          unsigned int next_min_index = min_index;
          while ((destination_map = map[next_min_index/2].node_link[2*k + (next_min_index & 0x01)]) != UNKNOWN) {
              distance =  (min_index & 0x01) ? (map[min_index/2].coordinate.east  - map[destination_map].coordinate.east) :
                                               (map[min_index/2].coordinate.north - map[destination_map].coordinate.north);
              if (distance < 0) distance = -distance;
              distance = TimeToRunStraight(distance); // переводим миллиметры в миллисекунды.

              destination = destination_map * 2 + (next_min_index & 0x01);
              if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
                  path_length_table[destination] = path_length_table[min_index] + distance;
                  if (insert_val(path_length_table[destination], destination)) return 1;
              }
              next_min_index = map[next_min_index/2].node_link[2*k + (next_min_index & 0x01)]*2 + (min_index & 0x01);
          }
      }
      distance = data.turncost;
      destination = min_index ^ 0x01;
      if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
          path_length_table[destination] = path_length_table[min_index] + distance;
          if (insert_val(path_length_table[destination], destination)) return 1;
      }
  }

  prev_bearing = north;
  min_index = (data.green_cell_nr << 1);
  // таблица расстояний составлена - надо строить маршрут.
  // Берём зелёную клетку и выясняем в каком направлении есть ход.
  for (unsigned int ii = north; ii <= west; ii++) {
      if (map[data.green_cell_nr].node_link[ii] != UNKNOWN) {
          prev_bearing = ii;
          min_index = (data.green_cell_nr << 1) | (ii & 0x01);
          break;
      }
  }
  data.pathlength = 0; // указатель пути на начало

  // Теперь скатываемся вниз для создания кратчайшего пути
  // от старта к финишу.
  while (path_length_table[min_index]) {
      for (k = 0; k < 3; k++) {
          if (k < 2) {
              int step = 0;
              unsigned int next_min_index = min_index;
              while ((destination_map = map[next_min_index/2].node_link[2*k + (next_min_index & 0x01)]) != UNKNOWN) {
                  distance =  (next_min_index & 0x01) ? (map[min_index/2].coordinate.east  - map[destination_map].coordinate.east) :
                                                        (map[min_index/2].coordinate.north - map[destination_map].coordinate.north);
                  if (distance < 0) distance = -distance;
                  distance = TimeToRunStraight(distance);

                  // до этого destination был индекс в карте,
                  // а теперь будет индексом в таблице расстояний
                  destination = destination_map*2 + (next_min_index & 0x01);
                  if ((path_length_table[min_index] - distance) == (path_length_table[destination])) {
                      bearing = (bearing_dir_t)((next_min_index & 0x01) + 2*k);
                      if (bearing != prev_bearing) {
                          data.length[data.pathlength++] = (command_turn | ((bearing - prev_bearing) & TURN_MASK));
                          if (data.pathlength >= MAX_MAP_SIZE*2) return 1;
                      }
                      do {
                          destination_map = map[min_index/2].node_link[2*k + (min_index & 0x01)];
                          distance =  (min_index & 0x01) ? (map[min_index/2].coordinate.east  - map[destination_map].coordinate.east) :
                                                           (map[min_index/2].coordinate.north - map[destination_map].coordinate.north);
                          if (distance < 0) distance = -distance;
                          data.length[data.pathlength++] = (command_forward | distance);
                          if (data.pathlength >= MAX_MAP_SIZE*2) return 1;
                          min_index = destination_map * 2 + (min_index & 0x01);

                      } while (0 < step--);

                      prev_bearing = bearing;
                      min_index = destination;
                      break_flag = 1;
                  }
                  if (break_flag) { break; }
                  next_min_index = map[next_min_index/2].node_link[2*k + (next_min_index & 0x01)]*2 + (min_index & 0x01);
                  step++;
              }
              if (break_flag) { break_flag = 0; break; }
          } else {
              if ((path_length_table[min_index] - data.turncost) == (path_length_table[min_index ^ 0x01])) {
                  min_index = min_index ^ 0x01;
                  break;
              }
          }
      }
  }
  return 0;
}

unsigned int search_way_simple(unsigned int start, unsigned int finish, bearing_dir_t my_bearing){

